//
//  main.c
//  Practice_8
//
//  Created by Kirill on 27.02.2018.
//  Copyright © 2018 Kirill. All rights reserved.
//

#include <stdio.h>

int main(int argc, const char * argv[]) {
    
    int task_num = 0;
    
    puts("\nПривет, это пятая задача в практики программировании!");
    
    puts("\n**********************************************************\n");
    puts("Task :");
    puts("1.    Заполнить матрицу m*n с клавиатуры. Найти сумму, количество и произведение нечетных элементов массива.");
    puts("2.    Заполнить случайными числами матрицу n*m. Вывести на печать вторую строку массива.");
    puts("**********************************************************\n");
    puts("");
    printf("Введите номер задачи (числ 1-2, если вы вводите в программу не число то она закроется): ");
    
    while(scanf("%d",&task_num) == 1){
        if(task_num == 1){
    
    return 0;
}
